{
  "Bài test sẽ tạo ra một cửa sổ đồ họa nặng trong 60 giây. Hãy quan sát có hiện tượng chớp giật, sọc ngang, hay các đốm màu lạ không? Máy có bị treo hoặc tự khởi động lại không?": "Test will create heavy graphics window for 60 seconds. Observe for flickering, horizontal lines, or strange color spots. Does machine freeze or restart?",
  "Bước này hiển thị thông tin cấu hình mà Windows nhận diện và tự động so sánh với thông tin từ BIOS để phát hiện sai lệch.": "This step displays configuration info that Windows recognizes and auto-compares with BIOS to detect discrepancies.",
  "Chú ý đến mục 'Trạng thái'. 'Tốt' là bình thường. 'Lỗi/Cảnh báo' là rủi ro cao. Bước tiếp theo sẽ kiểm tra tốc độ thực tế.": "Pay attention to 'Status'. 'Good' is normal. 'Error/Warning' is high risk. Next step checks actual speed.",
  "GPU là trái tim của đồ họa và game. Một GPU lỗi hoặc quá nhiệt có thể gây ra hiện tượng 'rác' hình (artifacts), treo máy hoặc sụt giảm FPS nghiêm trọng.": "GPU is heart of graphics and gaming. Faulty or overheating GPU can cause artifacts, freezing or severe FPS drops.",
  "Giám sát nhiệt độ và hiệu năng real-time giúp phát hiện vấn đề tản nhiệt, throttling và hiệu năng không ổn định.": "Real-time temperature and performance monitoring helps detect cooling issues, throttling and unstable performance.",
  "Gõ lần lượt tất cả các phím. Phím bạn gõ sẽ sáng lên màu xanh dương, và chuyển sang xanh lá khi được nhả ra. Vẽ trên vùng test touchpad, thử click trái/phải.": "Press all keys sequentially. Keys light up blue when pressed, turn green when released. Draw on touchpad test area, try left/right click.",
  "Màn hình là một trong những linh kiện đắt tiền và dễ hỏng nhất. Lỗi điểm chết, hở sáng, ám màu hay 'ung thư panel' (chớp giật ở cạnh viền) là những vấn đề nghiêm trọng.": "Display is one of most expensive and fragile components. Dead pixels, backlight bleeding, color staining or 'panel cancer' (edge flickering) are serious issues.",
  "Một CPU quá nhiệt sẽ tự giảm hiệu năng (throttling) gây giật lag. Bài test này sẽ đẩy CPU lên 100% tải để kiểm tra khả năng tản nhiệt của máy.": "Overheating CPU will throttle causing lag. This test pushes CPU to 100% load to check cooling capability.",
  "Một phím bị liệt, kẹt, hoặc touchpad bị loạn/mất cử chỉ đa điểm sẽ làm gián đoạn hoàn toàn công việc.": "Dead or stuck key, or malfunctioning touchpad/lost multi-touch will completely disrupt work.",
  "Ổ cứng sắp hỏng là mối rủi ro mất dữ liệu cực lớn. Bước này đọc 'báo cáo y tế' (S.M.A.R.T.) của ổ cứng để đánh giá độ bền.": "Failing hard drive is huge data loss risk. This step reads drive's 'health report' (S.M.A.R.T.) to assess durability.",
  "Đây là bước quan trọng nhất để chống lừa đảo. Các thông tin dưới đây được đọc trực tiếp từ BIOS và linh kiện phần cứng. Chúng cực kỳ khó làm giả từ bên trong Windows.": "Most important step to prevent fraud. Info below read directly from BIOS and hardware. Extremely difficult to fake from Windows."
}
